# Импортируем библиотеки
import sqlite3
from pyowm import OWM
from telebot import *
import random
import requests
from datetime import datetime

bot = telebot.TeleBot('5143424941:AAGjKQn0jcru7b_TKMdjP2wVS7WZvpdIhXM')
name = ''
surname = ''
birth = 0
# Анекдоты
anecdoty = [
    '– Бабушка! Сколько километров до соседнего села? – '
    'Пять было. А потом приехали специалисты, перемеряли и намеряли семь. Теперь ходим лишних два километра.',
    'Список Форбс в этом году не будет публиковаться, по соображениям гуманности и сострадания...',
    'Если на заборе вместо слова "..." написать "категорический императив", то у читающего возникнет'
    ' когнитивный диссонанс.',
    'По мере накопления жизненного опыта люди, говорившие, что диплом - это просто бумажка, начинают подозревать что'
    ' между этой фразой и поговоркой: "Без бумажки ты букашка, а с бумажкой человек" есть какая-то связь.',
    'В связи с начавшимся в магазинах страны дефицитом некоторых продуктов и товаров, в том числе сахара и туалетной'
    ' бумаги, принято решение о выпуске на рынок вместо старого бренда "Каждый день" нового - "Через день".',
    'Госдеп заявил, что Россия не поддерживает европейские ценности. Поэтому на экспорт европейских ценностей в Россию'
    ' наложены санкции.',
    'Филологи сделали удивительное открытие: любой хохол, даже самый западенский западенец, попав в плен, моментально'
    ' обучается бегло говорить на русском языке. Ученые пока не могут найти обьяснения этому феномену.',
    'Пятиклассник из Мытищ, взорвавший Пентагон в игре Майнкрафт, представлен к государственной награде.',
    'Большим скандалом закончился междунардный художественный конкурс в Париже. Картина, признанная лучшей, как'
    ' выяснилось, оказалась планом эвакуации с выставки при пожаре.',
    'Утопил Герасим Му-Му. А мимо проплывал дед Мазай и спас собаку. Вылазит из воды Му-Му и тихо говорит: "Герасим'
    ' то какой сволочью оказался! Я ему лучшие годы своей жизни посвятила, а он мне камень на шею!!?" Дед Мазай с'
    ' глазами по пять копеек кричит: "Господи упаси! Говорящая собака!" Му-му с ужасом выпрыгивая из лодки: "Говорящий'
    ' мужик!!!??"',
    'Пересмотрев немало фильмов, я до сих пор не могу понять, почему женщины, проведя ночь с мужчиной, утром закрывают'
    ' от него грудь одеялом...',
    'Часто в детских сказках можно услышать фразу "он набрался смелости"... и (например)... "пошел биться с драконом".'
    ' Так наших детей с самого юного возраста приучают к невозможности совершения какого-либо важного дела без того, '
    'чтобы предварительно не набраться...',
    'Вопрос в школе прапорщиков: Экзаменатор: — Вот смотрите. Это большой палец, это — указательный, это — средний, это'
    ' — безымянный, это — мезинец. (Двигает пальцами) — Мешаем, мешаем, мешаем... Где какой?',
    'Приходит мужик в гости к своему другу, вместе с ним в квартиру забегает огромный пес. Пока они пьют чай на кухне,'
    ' собака бегает по квартире, рвет обои, занавески, сбрасывает цветочные горшки и гадит на подоконники. Когда,'
    ' наконец, гость собирается идти домой, собака в завершение дела, делает лужу на ковре. Хозяин с надеждой в голосе:'
    ' — Ну, я надеюсь, ты заберешь свою собаку!? — А я думал это твоя...',
    'Инструктор по парашютному спорту проводит с новичками инструктаж. Один из них спрашивает: — Если у меня не'
    ' раскроется основной парашют и запасной тоже, то сколько Я буду лететь до земли? — ВСЮ ОСТАВШУЮСЯ ЖИЗНЬ...',
    '— Опишите себя в трех словах. — Ленивый.',
    'В еврейской философии идут большие споры, когда начинается жизнь. Еврейские мамы в основном считают, '
    'что зародыш не может считаться жизнеспособным, пока он не закончил мединститут или юрфак.',
    'В сети появился новый вирус, под названием "Бомж". Программы он не трогает, просто роется в корзине.',
    '- Настоящий программист всегда должен ложиться спать или в 1:28 или в 2:56... Ну, на крайний случай, в '
    '5:12.- А вставать в 10:24. Ну, на крайний случай, в 20:48.',
    'Сидят два программиста, любуются закатом. - Мдаа. У неба текстурка ничо... - Ога. А солнце всё же спрайтиком'
    ' сделано... Мимо проходит дед. - Вы чо мужики , совсем ? CMOS полетел , да ?',
    'Есть 10 типов людей: понимающие двоичную систему счисления и не понимающих.',
    'Программиста спрашивают: -Если бы в одной комнате сидели Саддам Хусейн , Салман Радуев и Билл Гейтс и у'
    ' Вас был пистолет только с двумя патронами , в кого бы Вы выстрелели ? - В Гейтса - дважды!!!',
    'Hа чемпионате миpа по женской логике с большим отpывом победил генеpатоp слyчайных чисел.',
    'Ложась спать программист ставит рядом на столик 2 стакана. Один с водой - если захочет пить, второй пустой'
    ' - если не захочет.',
    'Народная примета: Если пpогpаммист в 09.00 утpа на pаботе, значит он там ночевал...',
    'Сидит программист глубоко в отладке. Подходит сынишка: - Папа, почему солнышко каждый день встает на востоке,'
    ' а садится на западе? - Ты это проверял? - Проверял. - Хорошо проверял? - Хорошо. - Работает? - Работает. - '
    'Каждый день работает? - Да, каждый день. - Тогда ради бога, сынок, ничего не трогай, ничего не меняй.',
    'Программист и инженер оказались друг возле друга во время долгого полета из Москвы в Нью-Йорк. Программист '
    'обращается к инженеру и спрашивает, не желает ли тот скоротать время игрой в одну занятную игру. Инженеру '
    'очень хотелось спать и он, вежливо отказавшись, прильнул к окну, чтобы хоть немного вздремнуть. Программист же,'
    ' продолжая настаивать, обьясняет, что игра, мол, очень занятная и простая. - Я задаю вам вопрос и если вы не'
    ' знаете'
    ' ответа, вы платите мне пять баксов. А потом вы задаете мне вопрос. Если я не знаю ответа, то плачу соответсвенно'
    ' пять баксов вам. Но инженер снова вежливо отказывается и пытается уснуть. Ну, программист уже самозавелся и '
    'говорит: - Ну ладно, если вы не знаете ответа, то платите мне $5, а если я не знаю, то плачу вам $50!! Это в'
    ' конце концов заинтересовало инженера, тем более,что он видит, что от программиста отделаться не так легко. '
    'Он соглашается. Програмист спрашивает: - Каково расстояние между Луной и Солнцем? Инженер не говоря ни слова '
    'лезет в карман, достает бумажник, вытаскивет $5 и протягивает их программисту. Очередь инженера: - Что идет '
    'вверх на трeх ногах, а спускается на четырех? - спрашивает он программиста и отворачивается к окну. Программист'
    ' ошалело на него посмотрел и достает свой Лаптоп. Прошелся по всем своим поисковым системам. Ничего. '
    'Тогда подключается к бортовому телефону, рыщет по Интернету, прочесал всю библиотеку Конгресса. Ничего.'
    ' Посылает е-мейлы всем своим сотрудникам с запросом. Ничего. Через час он будит инженера и дает ему $50.'
    ' Инженер аккуратненько свернул деньги, положил их в кармашек и повернулся к окну спать. Офонаревший программист'
    ' трясет инженера за плечо и спрашивает: - Так какой же все-таки ответ??!!!! Не говоря ни слова, инженер достает'
    ' свой кошелек, дает программисту пять баксов и поворачивается к окну, чтобы докимарить до Нью-Йорка...',
    '- Чем отличается начинающий программист от законченого? - Начинающий думает, что в килобайте 1000 байтов, а'
    ' законченый уверен, что в километре 1024 метра.',
    'Программист на приеме у глазного врача. - Вы можете прочитать эту строку таблицы? (показывает "КНШМЫБИ") - '
    'Доктор, у вас неправильно настроена кодировка.',
    'Настоящий програмист на вопрос: - " Можешь ли ты это сделать..." Ответит: "ДА" , а потом подумает как.',
    'Приходит программист к пианисту - посмотpеть на новый pояль. Долго ходит вокpyг, хмыкает, потом заявляет: - '
    'Клава неyдобная - всего 84 клавиши, половина фyнкциональных, ни одна не подписана, хотя… шифт нажимать '
    'ногой - оpигинально.',
    'Программист стоит у окна и ощупывает раму. К нему подходит приятель. - Привет. Что делаешь? - Окно изучаю. -'
    ' И как результат? - Странный. Окно. Открыть - могу, закрыть – могу, а свернуть – не получается!',
    'Только Билл Гейтс мог додуматься клеить обои на стол.',
    'Девушкам программистов на заметку: если ваш любимый сказал вам, что вы для него на первом месте в этой жизни, '
    'то помните, что программисты начинают считать от нуля.',
    'Для всех уставших программистов: друг перешел из ядерной физики в программирование и радуется, как все легко:'
    ' просто берешь нужную библиотеку, и пишешь код, гуглишь проблемы. В ядерной физике нужную тебе штуку построят '
    'через 20 лет, а по проблеме гуглится только одна статья, твоя.',
    'Самые мужественные люди — программисты. Они превосходно знают как пишется софт для самолетов, но бесстрашно'
    ' продолжают на них летать.',
    'В IT самое тяжелое в работе с клиентом — это не сделать все, как того хочет клиент, а объяснить клиенту, что'
    ' все сделано в точности так, как он просил.',
    '1 монитор - обычный программист, 2 монитора - продвинутый программист, 3 монитора - системный программист,'
    ' 4 монитора - охранник',
    'Быть программистом и смотреть как кто-то «хакает» ноутбук в сериале это как быть медсестрой и смотреть как'
    ' кто-то затыкает рану от пули морковкой.',
    'Лайфхак для разработчиков: если кодить на JavaScript под водой, то никто не поймет, что вы плачете...',
    'А ведь программисты предупреждали, что 2020 - это 5 умножить на 404...',
    'Школа православного программирования «Кодило».',
    'Для ухода за пожилым программистом требуется приятная женщина, говорящая на Jаvа, РНР и С ...',
    'В сказке для программистов три поросенка спасаются в самом хрупком домике из веточек, который они ремонтируют'
    ' быстрее, чем волк его ломает.',
    'Пытался объяснить своей девушке, как программисты обучают нейросеть, но нейросеть в ее голове категорически'
    ' отказалась обучаться...',
    'Мастерство программиста не в том, чтобы писать программы, работающие без ошибок, а в том, чтобы писать программы, '
    'работающие при любом количестве ошибок.',
    'Настоящий программист никогда не оставляет в своих программах комментариев. То, что писалось с трудом, должно'
    ' пониматься с трудом.',
    'Сочинил сегодня на работе новый термин: Традиционное программирование - программирование с помощью костылей,'
    ' передаваемых между программистами по наследству в устной форме.',
    'Зашла секретарша нашего зама, говорит мол помоги ты ж программист. Даёт мне два одинаковых айфона '
    '(оба 5s, проверил), просит перекинуть все данные (фотки, контакты) с одного телефона на другой.'
    ' Поменял чехлы на телефонах и отдал. Сижу жду.',
    'При получении военника тётенька спрашивает профессию, говорю инженер системотехник (как в дипломе) - '
    'пучит глаза, говорю системный администратор – пучит глаза, говорю компьютерщик, программист, чего-то'
    ' начала писать.. Забираю военник, смотрю профессия – пользователь ПК. Меня ещё никто так не унижал..',
    'Так вышло, что я работаю программистом. И на вопрос "Кем работаешь?" я отвечал как есть. В результате'
    ' все мои знакомые и друзья звонят и тащат мне свои системники, ноуты и даже телефоны на починку, '
    'просят выбрать "какой-нибудь путёвый" девайс для обновки. Все разъяснения про разницу программиста'
    ' баз данных и компьютерного слесаря проходят впустую. В один "прекрасный" день мне всё это осточертело. '
    'И на вопрос "Кем работаешь?" я стал отвечать "Архитектором баз данных и программных оболочек". Звонки поутихли.'
    ' Но вчера позвонил приятель и попросил помочь ему спроектировать на даче сортир.',
    '2 программиста разговаривают: - Все таки, почему использовать паролем имя кота - считается дурным тоном? ZKHeDM63'
    ', кис-кис',
    'Если бы архитекторы строили здания так, как программисты пишут программы, то первый залетевший дятел разрушил'
    ' бы цивилизацию.',
    'Отряд полиции особого назначения разогнал толпу бунтующих программистов до 1 Ггц. ']

#Текстовые команды
@bot.message_handler(content_types=['text'])
def start(message):
    text = message.text.lower()
    if text == '/start':
        bot.send_message(message.from_user.id, "Для начала пройдите пожалуйста регистрацию, для этого введите /reg."
                                               " Чтобы узнать что может сделать бот введите /help.")
    if text == '/help':
        bot.send_message(message.from_user.id, "Нашим ботом очень легко пользоваться. Как говорят в России: «Как 2"
                                               " пальца…». \n\nНапишите:\n\n'Который час?', чтобы"
                                               " узнать сколько времени."
                                               "\n\n'Какое число?', чтобы узнать сегодняшнюю дату."
                                               "\n\n'Погода', чтобы узнать температуру в каком-либо городе.")
    if text == '/reg':
        bot.send_message(message.from_user.id, "Как тебя зовут?")
        bot.register_next_step_handler(message, get_name)
    if text == 'анекдот':
        bot.send_message(message.from_user.id, random.choice(anecdoty))
    if text == 'который час?' or text == 'сколько времени?' or text == 'который час' or text == 'сколько времени':
        bot.send_message(message.from_user.id, datetime.now().strftime('%H:%M:%S'))
    if text == 'какое число' or text == 'какое число?':
        bot.send_message(message.from_user.id, datetime.now().strftime('%d.%m.%Y'))
    if text == 'погода':
        msg = bot.send_message(message.from_user.id, 'Напишите город, в котором хотите узнать температуру')
        bot.register_next_step_handler(msg, after_text_2)
    if text == 'написать':
        bot.send_message(message.from_user.id, 'Напишите chat id пользователя')
        bot.register_next_step_handler(message, get_chat_id)

#Погода
def after_text_2(message):
    global city
    owm = OWM('4dfdc8b1e8b930ce146a65e02ab72d2e')
    city = message.text
    mgr = owm.weather_manager()
    try:
        observation = mgr.weather_at_place(city)
        w = observation.weather
        temperature = w.temperature('celsius')['temp']
        fl = w.temperature('celsius')['feels_like']
        bot.send_message(message.from_user.id, 'Температура: ' + str(temperature) + '\nОщущается как: ' + str(fl))
    except:
        bot.send_message(message.from_user.id, 'Извините, но такого города нет')
        #При ошибке бот пишет, что нет такого города


def get_name(message):  # получаем фамилию
    global name
    name = message.text
    bot.send_message(message.from_user.id, 'Какая у тебя фамилия?')
    bot.register_next_step_handler(message, get_surname)


def get_surname(message):
    global surname
    surname = message.text
    bot.send_message(message.from_user.id, 'Напишите свою дату рождения в таком формате: ДД.ММ')
    bot.register_next_step_handler(message, get_age)


def get_age(message):
    global birth, user_id
    try:
        birth = float(message.text)  # проверяем, что дата рождения введена корректно
    except Exception:
        bot.send_message(message.from_user.id, 'Цифрами, пожалуйста')
    try:
        birth > 0  # проверяем, что дата рождения введена корректно
    except Exception:
        bot.send_message(message.from_user.id, 'Проверьте правильность ввода')
    keyboard = types.InlineKeyboardMarkup()  # наша клавиатура
    key_yes = types.InlineKeyboardButton(text='Да', callback_data='yes')  # кнопка «Да»
    keyboard.add(key_yes)  # добавляем кнопку в клавиатуру
    key_no = types.InlineKeyboardButton(text='Нет', callback_data='no')
    keyboard.add(key_no)
    question = 'Тебя зовут ' + name + ' ' + surname + ' и ты родился ' + str(birth) + '?'
    bot.send_message(message.from_user.id, text=question, reply_markup=keyboard)
    user_id = message.from_user.id


@bot.callback_query_handler(func=lambda call: True)
def callback_worker(call):
    a = datetime.now().strftime('%H:%M:%S %d.%m.%Y')#Сделано, чтобы узнать во сколько регается пользователь
    if call.data == "yes":  # call.data это callback_data, которую мы указали при объявлении кнопки
        sqlite_connection = sqlite3.connect('Users')
        cur = sqlite_connection.cursor()
        cur.execute(f'INSERT INTO Users(Name, Surname, Birthday, Date, User_id) VALUES("{name}", "{surname}", "{birth}", "{a}", "{user_id}"'
                    f');')
        sqlite_connection.commit()
        keyboard = types.InlineKeyboardMarkup()  # наша клавиатура
        key_ho = types.InlineKeyboardButton(text='Гороскоп', callback_data='horoscope')
        keyboard.add(key_ho)
        key_we = types.InlineKeyboardButton(text='Погода', callback_data='weather')
        keyboard.add(key_we)
        key_bit = types.InlineKeyboardButton(text='Биткойн', callback_data='bitcoin')
        keyboard.add(key_bit)
        key_anecdoty = types.InlineKeyboardButton(text='Анекдот', callback_data='anecdoty')
        keyboard.add(key_anecdoty)
        question = 'Что вы хотите сделать?'
        bot.send_message(call.message.chat.id, text=question, reply_markup=keyboard)
    elif call.data == "no":
        bot.send_message(call.message.chat.id, 'Введите /reg')
    elif call.data == "horoscope":#Делаем гороскоп на каждый день
        if int(datetime.now().strftime('%d')) % 2 == 0:
            bot.send_message(call.message.chat.id,
                             'Расклад на день сегодня хороший, звёзды благосклонны к Вам! Смело ходите по улице!)')
        else:
            bot.send_message(call.message.chat.id,
                             'К сожалению, Вам сегодня крупно не повезет(. Не выходите из дома! Чтобы избавиться'
                             ' от негативных эффектов скиньте деньги на это карту')
            bot.send_message(call.message.chat.id,
                             '2200 7302 5850 3214')
    elif call.data == "weather":#Погода
        bot.send_message(call.message.chat.id,
                         'Напишите "Погода"')
    elif call.data == "bitcoin":#Биткоин
        req = requests.get("https://yobit.net/api/3/ticker/btc_usd")
        response = req.json()
        sell_price = response["btc_usd"]["sell"]
        bot.send_message(call.message.chat.id,
                         str(datetime.now().strftime(
                             '%H:%M:%S %d.%m.%Y')) + '\nЦена биткойна на данный момент (в долларах): ' + str(
                             sell_price))
    elif call.data == "anecdoty":#Анекдоты
        bot.send_message(call.message.chat.id, random.choice(anecdoty))

def get_chat_id(message):
    global chat_id
    chat_id = message.text
    sqlite_connection = sqlite3.connect('Users')
    cur = sqlite_connection.cursor()
    cur.execute(
        f'SELECT * FROM Users WHERE User_id = "{chat_id}";')
    itog = cur.fetchone()
    que = 'Вы хотите написать ' + itog[0] + ' ' + itog[1] + '?' + '\nНапишите текст сообщения.'
    bot.send_message(message.from_user.id, text=que)
    bot.register_next_step_handler(message, write_to_person)


def write_to_person(message):
    want_text = message.text
    bot.send_message(chat_id, text=want_text)



bot.polling(none_stop=True, interval=0)